# Import Libraries

In [5]:
import numpy as np
import pandas as pd

In [3]:
np.random.rand(36).reshape((6,6))

array([[0.34463565, 0.7750307 , 0.47005223, 0.85533307, 0.74777208,
        0.87644414],
       [0.03110332, 0.52008193, 0.54724648, 0.40912058, 0.310083  ,
        0.97525533],
       [0.45110899, 0.37057858, 0.57605799, 0.3601541 , 0.04889753,
        0.99103484],
       [0.35327079, 0.99324994, 0.1476207 , 0.56532186, 0.9517132 ,
        0.64709684],
       [0.5636985 , 0.16145413, 0.26367043, 0.47996197, 0.75868564,
        0.22813863],
       [0.29279871, 0.25436464, 0.04178619, 0.65439492, 0.25884794,
        0.42255535]])

<B>Create dataframe with random numbers shape(6,6)</B>

In [8]:
df_obj = pd.DataFrame(np.random.rand(36).reshape((6,6)), 
                      index = ['row1','row2','row3','row4','row5','row6'],
                      columns = ['col1','col2','col3','col4','col5','col6'])
df_obj

          col1      col2      col3      col4      col5      col6
row1  0.651039  0.324902  0.150997  0.259783  0.228809  0.001820
row2  0.473057  0.434270  0.778130  0.799054  0.899877  0.005488
row3  0.507280  0.503971  0.195925  0.469043  0.490962  0.272668
row4  0.914786  0.191257  0.651235  0.611400  0.514822  0.038620
row5  0.354705  0.764823  0.142906  0.958251  0.702997  0.723984
row6  0.973280  0.597874  0.653577  0.826596  0.564565  0.277819

<B>Retrieve values from (row2 & row5) AND (col5 & col2)</B>

In [9]:
df_obj.loc[['row2','row5'], ['col5','col2']]

          col5      col2
row2  0.899877  0.434270
row5  0.702997  0.764823

<B>Data Slicing</B>

In [12]:
df_obj.loc['row2':'row5']

          col1      col2      col3      col4      col5      col6
row2  0.473057  0.434270  0.778130  0.799054  0.899877  0.005488
row3  0.507280  0.503971  0.195925  0.469043  0.490962  0.272668
row4  0.914786  0.191257  0.651235  0.611400  0.514822  0.038620
row5  0.354705  0.764823  0.142906  0.958251  0.702997  0.723984

In [13]:
#this will only compare 
df_obj < .2

       col1   col2   col3   col4   col5   col6
row1  False  False   True  False  False   True
row2  False  False  False  False  False   True
row3  False  False   True  False  False  False
row4  False   True  False  False  False   True
row5  False  False   True  False  False  False
row6  False  False  False  False  False  False

In [21]:
#to print filtered objects
trun_df = df_obj[df_obj < .2]
trun_df

      col1      col2      col3  col4  col5      col6
row1   NaN       NaN  0.150997   NaN   NaN  0.001820
row2   NaN       NaN       NaN   NaN   NaN  0.005488
row3   NaN       NaN  0.195925   NaN   NaN       NaN
row4   NaN  0.191257       NaN   NaN   NaN  0.038620
row5   NaN       NaN  0.142906   NaN   NaN       NaN
row6   NaN       NaN       NaN   NaN   NaN       NaN

In [20]:
df_obj.loc[['row1'],['col1']] = 8
df_obj

          col1      col2      col3      col4      col5      col6
row1  8.000000  0.324902  0.150997  0.259783  0.228809  0.001820
row2  0.473057  0.434270  0.778130  0.799054  0.899877  0.005488
row3  0.507280  0.503971  0.195925  0.469043  0.490962  0.272668
row4  0.914786  0.191257  0.651235  0.611400  0.514822  0.038620
row5  0.354705  0.764823  0.142906  0.958251  0.702997  0.723984
row6  0.973280  0.597874  0.653577  0.826596  0.564565  0.277819

<B>Missing values in python</B>

In [22]:
#assign nan values
missing =np.nan
missing

nan

In [24]:
#count the missing values
trun_df.isnull().sum()

col1    6
col2    5
col3    3
col4    6
col5    6
col6    3
dtype: int64

In [25]:
#fill na with zeros
filled_df = trun_df.fillna(0)
filled_df

      col1      col2      col3  col4  col5      col6
row1   0.0  0.000000  0.150997   0.0   0.0  0.001820
row2   0.0  0.000000  0.000000   0.0   0.0  0.005488
row3   0.0  0.000000  0.195925   0.0   0.0  0.000000
row4   0.0  0.191257  0.000000   0.0   0.0  0.038620
row5   0.0  0.000000  0.142906   0.0   0.0  0.000000
row6   0.0  0.000000  0.000000   0.0   0.0  0.000000

In [28]:
filled_df = filled_df.fillna({'row6':8})
filled_df

      col1      col2      col3  col4  col5      col6
row1   0.0  0.000000  0.150997   0.0   0.0  0.001820
row2   0.0  0.000000  0.000000   0.0   0.0  0.005488
row3   0.0  0.000000  0.195925   0.0   0.0  0.000000
row4   0.0  0.191257  0.000000   0.0   0.0  0.038620
row5   0.0  0.000000  0.142906   0.0   0.0  0.000000
row6   0.0  0.000000  0.000000   0.0   0.0  0.000000

In [30]:
#forward fill - fills the Nan values with first element
special_fill = trun_df.fillna(method = 'ffill')
special_fill

      col1      col2      col3  col4  col5      col6
row1   NaN       NaN  0.150997   NaN   NaN  0.001820
row2   NaN       NaN  0.150997   NaN   NaN  0.005488
row3   NaN       NaN  0.195925   NaN   NaN  0.005488
row4   NaN  0.191257  0.195925   NaN   NaN  0.038620
row5   NaN  0.191257  0.142906   NaN   NaN  0.038620
row6   NaN  0.191257  0.142906   NaN   NaN  0.038620

In [31]:
#drop na values from entire column
df_no_nan = trun_df.dropna()
df_no_nan

Empty DataFrame
Columns: [col1, col2, col3, col4, col5, col6]
Index: []

In [32]:
#drop columns with NaN values
special_fill.dropna(axis=1)

          col3      col6
row1  0.150997  0.001820
row2  0.150997  0.005488
row3  0.195925  0.005488
row4  0.195925  0.038620
row5  0.142906  0.038620
row6  0.142906  0.038620

<B> Remove Duplicates </B>

In [33]:
dup_df = special_fill.loc[:,'col3']
dup_df

row1    0.150997
row2    0.150997
row3    0.195925
row4    0.195925
row5    0.142906
row6    0.142906
Name: col3, dtype: float64

In [34]:
dup_df.duplicated()

row1    False
row2     True
row3    False
row4     True
row5    False
row6     True
Name: col3, dtype: bool

In [36]:
#drops duplicate from entire table
dup_df.drop_duplicates()

row1    0.150997
row3    0.195925
row5    0.142906
Name: col3, dtype: float64

In [38]:
#drop duplicate from specific column
special_fill_col = special_fill.drop_duplicates(['col6'])
special_fill_col

      col1      col2      col3  col4  col5      col6
row1   NaN       NaN  0.150997   NaN   NaN  0.001820
row2   NaN       NaN  0.150997   NaN   NaN  0.005488
row4   NaN  0.191257  0.195925   NaN   NaN  0.038620

# Concatenating data and transformation

In [39]:
df_concat = pd.DataFrame(np.arange(36).reshape((6,6)))
df_concat

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [40]:
df_concat1 = pd.DataFrame(np.arange(15).reshape((5,3)))
df_concat1

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

<B>Concatenating data</B>

In [41]:
#concatenate two df with columns
pd.concat([df_concat,df_concat1], axis =1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [42]:
#concatenate two df with columns
pd.concat([df_concat,df_concat1])

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

In [43]:
#drop rows
df_concat.drop([0,2])

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [44]:
#drop columns
df_concat.drop([0,2], axis =1)

    1   3   4   5
0   1   3   4   5
1   7   9  10  11
2  13  15  16  17
3  19  21  22  23
4  25  27  28  29
5  31  33  34  35

In [46]:
#Adding data
series_obj = pd.Series(np.arange(6))
series_obj.name = 'added_variable'
series_obj

0    0
1    1
2    2
3    3
4    4
5    5
Name: added_variable, dtype: int64

In [47]:
variable_added = pd.DataFrame.join(df_concat, series_obj)
variable_added

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [48]:
added_datatable = variable_added.append(variable_added, ignore_index = False)
added_datatable

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [49]:
added_datatable = variable_added.append(variable_added, ignore_index = True)
added_datatable

     0   1   2   3   4   5  added_variable
0    0   1   2   3   4   5               0
1    6   7   8   9  10  11               1
2   12  13  14  15  16  17               2
3   18  19  20  21  22  23               3
4   24  25  26  27  28  29               4
5   30  31  32  33  34  35               5
6    0   1   2   3   4   5               0
7    6   7   8   9  10  11               1
8   12  13  14  15  16  17               2
9   18  19  20  21  22  23               3
10  24  25  26  27  28  29               4
11  30  31  32  33  34  35               5

<B>Sorting Data</B>

In [51]:
df_sorted = df_concat.sort_values(by=(5), ascending = [False])
df_sorted

    0   1   2   3   4   5
5  30  31  32  33  34  35
4  24  25  26  27  28  29
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

# Grouping And Aggregation

In [53]:
cars_df =pd.read_csv('mtcars.csv')
cars_df

,Unnamed: 0,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
5,Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
10,Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
11,Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
12,Merc 450SL,17.3,8,275.8,180,3.07,3.730,17.60,0,0,3,3
13,Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
16,Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
21,Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
22,AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
24,Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2